AEIOUYD = ["a", "e", "i", "o", "u", "y", "d"]
AEIOUYD_VN = list("aáàảãạăắằẳẵặâấầẩẫậeéèẻẽẹêếềểễệiíìỉĩịoóòỏõọôốồổỗộơớờởỡợuúùủũụưứừửữựyýỳỷỹỵdđ")
A_LIST = list("aáàảãạăắằẳẵặâấầẩẫậ")
E_LIST = list("eéèẻẽẹêếềểễệ")
I_LIST = list("iíìỉĩị")
O_LIST = list("oóòỏõọôốồổỗộơớờởỡợ")
U_LIST = list("uúùủũụưứừửữự")
Y_LIST = list("yýỳỷỹỵ")
D_LIST = list("dđ")
LEGAL = " !\"#$%&'()*+,-./0123456789:;<=>?@[\\]^_`abcdefghijklmnopqrstuvwxyzáàảãạăắằẳẵặâấầẩẫậéèẻẽẹêếềểễệíìỉĩịóòỏõọôốồổỗộơớờởỡợúùủũụưứừửữựýỳỷỹỵđ{|}~"
PUNCT = "!\"#$%&'()*+,-./:;<=>?@[\\]^_`{|}~"
PUNCT_LM = "!\"#$%&'()*+,-./:;<=>?@[\\]^_`{|}~…’—‘"
